There are mutiple methods to add column to a dataframe.
The methods are : 
    1. insert() method
    2. assgin() method
    3. using dictionary 
    4. using list
    5. using .loc()
    6. adding mutiple columns to a dataframe


Link - https://www.geeksforgeeks.org/adding-new-column-to-existing-dataframe-in-pandas/

In [3]:
import pandas as pd

data = {'Name' : ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height' : [5.1, 6.2, 5.1, 5.2],
        'Qualification' : ['Msc','MA','Msc','Msc']}

df = pd.DataFrame(data)
df
df

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

In [5]:
df.insert(2, 'Age',[21, 23, 34, 31])
df

     Name  Height  Age Qualification
0     Jai     5.1   21           Msc
1  Princi     6.2   23            MA
2  Gaurav     5.1   34           Msc
3    Anuj     5.2   31           Msc